import spacy


"""ὦ ἄνδρες Ἀθηναῖοι πεπόνθατε ὑπὸ τῶν ἐμῶν κατηγόρων, οὐκ οἶδα· ἐγὼ δ' οὖν καὶ αὐτὸς ὑπ' αὐτῶν ὀλίγου ἐμαυτοῦ ἐπελαθόμην, οὕτω πιθανῶς ἔλεγον. καίτοι ἀληθές γε ὡς ἔπος εἰπεῖν οὐδὲν εἰρήκασιν. μάλιστα δὲ αὐτῶν ἓν ἐθαύμασα τῶν πολλῶν ὧν ἐψεύσαντο, τοῦτο ἐν ᾧ ἔλεγον ὡς χρῆν ὑμᾶς εὐλαβεῖσθαι μὴ ὑπ' ἐμοῦ ἐξαπατηθῆτε ὡς δεινοῦ ὄντος λέγειν. τὸ γὰρ μὴ αἰσχυνθῆναι ὅτι αὐτίκα ὑπ' ἐμοῦ ἐξελεγχθήσονται ἔργῳ, """

nlp = spacy.load('grc_odycy_joint_trf')

guidelines = []

doc = nlp("""Ἀσιάτιδος γῆς σχῆμα, Θηβαία πόλις, 
ὅθεν ποθ' ἕδνων σὺν πολυχρύσωι χλιδῆι 
Πριάμου τύραννον ἑστίαν ἀφικόμην 
δάμαρ δοθεῖσα παιδοποιὸς Ἕκτορι, 
ζηλωτὸς ἔν γε τῶι πρὶν Ἀνδρομάχη χρόνωι, 
νῦν δ', εἴ τις ἄλλη, δυστυχεστάτη γυνή 
ἐμοῦ πέφυκεν ἢ γενήσεταί ποτε· 
ἥτις πόσιν μὲν Ἕκτορ' ἐξ Ἀχιλλέως 
θανόντ' ἐσεῖδον, παῖδά""")


for index,token in enumerate(doc):
   """ print(index)
   print(token.orth_, token.lemma_, token.pos_, list(token.morph))
   print("-------------------------")
   print() """
   if token.orth_ == " ": continue

   guidelines.append((token.orth_, token.lemma_))

print(guidelines)


   

   

